tutorials/interTrackFoam/hydrofoil/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// ************************************************************************** //

polyMeshPatches  1( freeSurface );

boundary
{
    inlet
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  inlet;
    }

    outlet
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  outlet;
    }

    frontAndBack
    {
        type                empty;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  frontAndBackPlanes;
    }
}


// ************************************************************************** //
